In [1]:
import numpy as np
import pandas as pd

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[-1.61697544,  0.56919658,  0.18487117],
       [ 1.15290158,  0.26324409,  0.19691373],
       [-0.77123935,  1.06472067,  0.98003134],
       [ 0.4557522 ,  0.27294338, -1.90451699]])

In [8]:
dataFrame = pd.DataFrame(data)

In [9]:
dataFrame

          0         1         2
0 -1.616975  0.569197  0.184871
1  1.152902  0.263244  0.196914
2 -0.771239  1.064721  0.980031
3  0.455752  0.272943 -1.904517

In [11]:
type(dataFrame[0])

pandas.core.series.Series

In [13]:
yeniDataFrame = pd.DataFrame(data,index=["Selin","Leyla","Nazlı","Selena"],columns=["Maas","Yas","CalismaSaatleri"])

In [14]:
yeniDataFrame

            Maas       Yas  CalismaSaatleri
Selin  -1.616975  0.569197         0.184871
Leyla   1.152902  0.263244         0.196914
Nazlı  -0.771239  1.064721         0.980031
Selena  0.455752  0.272943        -1.904517

In [15]:
yeniDataFrame["Maas"]

Selin    -1.616975
Leyla     1.152902
Nazlı    -0.771239
Selena    0.455752
Name: Maas, dtype: float64

In [16]:
yeniDataFrame["CalismaSaatleri"]

Selin     0.184871
Leyla     0.196914
Nazlı     0.980031
Selena   -1.904517
Name: CalismaSaatleri, dtype: float64

In [17]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Selin  -1.616975  0.569197
Leyla   1.152902  0.263244
Nazlı  -0.771239  1.064721
Selena  0.455752  0.272943

In [21]:
yeniDataFrame.loc["Selin"] #yerini bul

Maas              -1.616975
Yas                0.569197
CalismaSaatleri    0.184871
Name: Selin, dtype: float64

In [22]:
yeniDataFrame.iloc[1]

Maas               1.152902
Yas                0.263244
CalismaSaatleri    0.196914
Name: Leyla, dtype: float64

In [23]:
yeniDataFrame

            Maas       Yas  CalismaSaatleri
Selin  -1.616975  0.569197         0.184871
Leyla   1.152902  0.263244         0.196914
Nazlı  -0.771239  1.064721         0.980031
Selena  0.455752  0.272943        -1.904517

In [24]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [25]:
yeniDataFrame

            Maas       Yas  CalismaSaatleri  Emeklilik Yasi
Selin  -1.616975  0.569197         0.184871        1.138393
Leyla   1.152902  0.263244         0.196914        0.526488
Nazlı  -0.771239  1.064721         0.980031        2.129441
Selena  0.455752  0.272943        -1.904517        0.545887

In [29]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1) #drop düşürmek demek, axis 1 ise column da arıyor , row için ise axis = 0

            Maas       Yas  CalismaSaatleri
Selin  -1.616975  0.569197         0.184871
Leyla   1.152902  0.263244         0.196914
Nazlı  -0.771239  1.064721         0.980031
Selena  0.455752  0.272943        -1.904517

In [31]:
yeniDataFrame.drop("Selena") #yeniDataFrame.drop("Selena", axis = 0) aynı çıktıyı verir

           Maas       Yas  CalismaSaatleri  Emeklilik Yasi
Selin -1.616975  0.569197         0.184871        1.138393
Leyla  1.152902  0.263244         0.196914        0.526488
Nazlı -0.771239  1.064721         0.980031        2.129441

In [32]:
yeniDataFrame

            Maas       Yas  CalismaSaatleri  Emeklilik Yasi
Selin  -1.616975  0.569197         0.184871        1.138393
Leyla   1.152902  0.263244         0.196914        0.526488
Nazlı  -0.771239  1.064721         0.980031        2.129441
Selena  0.455752  0.272943        -1.904517        0.545887

In [33]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace=True) #inplace : yerinde içerisinde bu işlemi yap, gerçekten siliniyor

In [34]:
yeniDataFrame

            Maas       Yas  CalismaSaatleri
Selin  -1.616975  0.569197         0.184871
Leyla   1.152902  0.263244         0.196914
Nazlı  -0.771239  1.064721         0.980031
Selena  0.455752  0.272943        -1.904517

In [36]:
yeniDataFrame.loc["Leyla"]["Yas"]

0.2632440877796478

In [38]:
yeniDataFrame.loc["Nazlı","Maas"]

-0.7712393453935915

In [40]:
booleanFrame = yeniDataFrame < 0

In [41]:
booleanFrame

         Maas    Yas  CalismaSaatleri
Selin    True  False            False
Leyla   False  False            False
Nazlı    True  False            False
Selena  False  False             True

In [42]:
yeniDataFrame[booleanFrame]

            Maas  Yas  CalismaSaatleri
Selin  -1.616975  NaN              NaN
Leyla        NaN  NaN              NaN
Nazlı  -0.771239  NaN              NaN
Selena       NaN  NaN        -1.904517

In [43]:
yeniDataFrame["Yas"] > 0

Selin     True
Leyla     True
Nazlı     True
Selena    True
Name: Yas, dtype: bool

In [46]:
yeniDataFrame[yeniDataFrame["Yas"] > 0] # yaşı 0 dan büyük olanları getirir

            Maas       Yas  CalismaSaatleri
Selin  -1.616975  0.569197         0.184871
Leyla   1.152902  0.263244         0.196914
Nazlı  -0.771239  1.064721         0.980031
Selena  0.455752  0.272943        -1.904517

In [47]:
yeniDataFrame.reset_index()

    index      Maas       Yas  CalismaSaatleri
0   Selin -1.616975  0.569197         0.184871
1   Leyla  1.152902  0.263244         0.196914
2   Nazlı -0.771239  1.064721         0.980031
3  Selena  0.455752  0.272943        -1.904517

In [48]:
yeniDataFrame

            Maas       Yas  CalismaSaatleri
Selin  -1.616975  0.569197         0.184871
Leyla   1.152902  0.263244         0.196914
Nazlı  -0.771239  1.064721         0.980031
Selena  0.455752  0.272943        -1.904517

In [49]:
yeniIndeksListesi = ["Sel","Ley","Naz","Sele"]

In [50]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [51]:
yeniDataFrame

            Maas       Yas  CalismaSaatleri Yeni Indeks
Selin  -1.616975  0.569197         0.184871         Sel
Leyla   1.152902  0.263244         0.196914         Ley
Nazlı  -0.771239  1.064721         0.980031         Naz
Selena  0.455752  0.272943        -1.904517        Sele

In [52]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  CalismaSaatleri
Yeni Indeks
Sel         -1.616975  0.569197         0.184871
Ley          1.152902  0.263244         0.196914
Naz         -0.771239  1.064721         0.980031
Sele         0.455752  0.272943        -1.904517

In [53]:
yeniDataFrame

            Maas       Yas  CalismaSaatleri Yeni Indeks
Selin  -1.616975  0.569197         0.184871         Sel
Leyla   1.152902  0.263244         0.196914         Ley
Nazlı  -0.771239  1.064721         0.980031         Naz
Selena  0.455752  0.272943        -1.904517        Sele

In [54]:
yeniDataFrame.set_index("Yeni Indeks",inplace = True)

In [55]:
yeniDataFrame

                 Maas       Yas  CalismaSaatleri
Yeni Indeks
Sel         -1.616975  0.569197         0.184871
Ley          1.152902  0.263244         0.196914
Naz         -0.771239  1.064721         0.980031
Sele         0.455752  0.272943        -1.904517

In [56]:
yeniDataFrame.loc["Sel"]

Maas              -1.616975
Yas                0.569197
CalismaSaatleri    0.184871
Name: Sel, dtype: float64

In [57]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [58]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [59]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [60]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [61]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [62]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [63]:
benimCizgiFİlmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [64]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFİlmListem)

In [65]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [66]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [67]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [69]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [70]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [71]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F